In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series([0,1,2], index = ['a','b','c'])

In [3]:
ser1

a    0
b    1
c    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6], index = ['a','b','c','d'])

In [5]:
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [6]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [9]:
dframe = DataFrame((np.arange(25).reshape(5,5)),columns = list('ABCDE'), 
                   index=['LA','DEL','HYD','SEC','BNG'])

In [10]:
dframe

      A   B   C   D   E
LA    0   1   2   3   4
DEL   5   6   7   8   9
HYD  10  11  12  13  14
SEC  15  16  17  18  19
BNG  20  21  22  23  24

In [24]:
dframe2 = DataFrame((np.arange(36).reshape(6,6)), columns= list('ABCDEF'),
                    index = ['LA','DEL','HYD','SEC','BNG','fuc'])
dframe2

      A   B   C   D   E   F
LA    0   1   2   3   4   5
DEL   6   7   8   9  10  11
HYD  12  13  14  15  16  17
SEC  18  19  20  21  22  23
BNG  24  25  26  27  28  29
fuc  30  31  32  33  34  35

dframe+dframe2

In [20]:
dframe

      A   B   C   D   E
LA    0   1   2   3   4
DEL   5   6   7   8   9
HYD  10  11  12  13  14
SEC  15  16  17  18  19
BNG  20  21  22  23  24

In [22]:
dframe.add(dframe2, fill_value=0)

        A     B     C     D     E     F
BNG  44.0  46.0  48.0  50.0  52.0  29.0
DEL  11.0  13.0  15.0  17.0  19.0  11.0
HYD  22.0  24.0  26.0  28.0  30.0  17.0
LA    0.0   2.0   4.0   6.0   8.0   5.0
SEC  33.0  35.0  37.0  39.0  41.0  23.0
fuc  30.0  31.0  32.0  33.0  34.0  35.0

In [25]:
ser3 = dframe2.ix[0]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [26]:
ser3

A    0
B    1
C    2
D    3
E    4
F    5
Name: LA, dtype: int64

In [27]:
dframe2 - ser3

      A   B   C   D   E   F
LA    0   0   0   0   0   0
DEL   6   6   6   6   6   6
HYD  12  12  12  12  12  12
SEC  18  18  18  18  18  18
BNG  24  24  24  24  24  24
fuc  30  30  30  30  30  30